performance/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Ramp up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
  payload:
    path: "./test-data.csv"
    fields:
      - "email"
      - "password"
      - "origin"
      - "destination"
      - "departureDate"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 2
      - get:
          url: "/api/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Flight Search Flow"
    weight: 50
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - post:
          url: "/api/search/flights"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            origin: "{{ origin }}"
            destination: "{{ destination }}"
            departureDate: "{{ departureDate }}"
            passengers: 1
            cabinClass: "economy"
          capture:
            - json: "$.searchId"
              as: "searchId"
      - think: 3
      - get:
          url: "/api/search/results/{{ searchId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Chat Interaction Flow"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - post:
          url: "/api/chat/session"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.sessionId"
              as: "sessionId"
      - think: 2
      - post:
          url: "/api/chat/message"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            sessionId: "{{ sessionId }}"
            message: "I want to fly from {{ origin }} to {{ destination }} on {{ departureDate }}"
      - think: 5
      - get:
          url: "/api/chat/history/{{ sessionId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"